{ 
  "Missing-Person" : [

    {
      "id": 0,
      "Name": "Anna-Kay Thomas",
      "Gender": "Female",
      "Age": "21-years-old",
      "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/10/Anna-Kay-Thomas-Web-495x400.jpg",
      "profile": "ANNA-KAY THOMAS\n\nTwenty-one-year-old Anna-Kay Thomas, otherwise called ‘Anna’, of Bodles Crescent, Old Harbour, St. Catherine has been missing since Monday, October 04.\n\nShe is of dark complexion, medium build and about 173 centimetres (5 feet 8 inches) tall.\n\nReports from the Old Harbour Police are that about 6:00 p.m., Thomas was last seen at home wearing a green blouse, jeans and a pair of black slippers. Efforts to contact her have proven futile.\n\nAnyone knowing the whereabouts of Anna-Kay Thomas is being asked to contact the Old Harbour Police at (876) 983-2255, police 119 emergency number or the nearest police station."
    },

    {
      "id": 1,
      "Name": "Alisha Joseph",
      "Gender": "Female",
      "Age": "17-years-old",
      "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/10/Alisha-Joseph-Web-495x400.jpg",
      "profile": "ALISHA JOSEPH\n\nAn Ananda Alert has been activated for 17-year-old Alisha Joseph of Brandon Hill, St. Andrew who has been missing since Monday, October 11.\n\nShe is of dark complexion, slim build, and is about 168 centimetres (5 feet 6 inches) tall.\n\nReports from the Stony Hill Police are that about 9:00 a.m., Alisha was last seen at home. Her mode of dress at the time she went missing is unknown. She has not been heard from since.\n\nAnyone knowing the whereabouts of Alisha Joseph is being asked to contact the Stony Hill Police at 876-942-2223, Police 119 emergency number of the nearest police station."
    },

    {
       "id": 2,
       "Name": "Whittiyer Thomas",
       "Gender": "Female",
       "Age": "13-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/10/Whittiyer-Thomas-Web-495x400.jpg",
       "profile": "WHITTIYER THOMAS\n\nAn Ananda Alert has been activated for 13-year-old Whittiyer Thomas of Jeffrey Town, St. Mary, who has been missing since Saturday, October 9.\n\nShe is of dark complexion, slim build and is about 173 centimetres (5 feet 8 inches) tall.\n\nReports from the Guys Hill Police are that Whittiyer was last seen at Benbow district, Guys Hill, St. Catherine about 4:23 p.m., wearing a black blouse, black pants and a pair of black slippers.\n\nAnyone with information as to the whereabouts of Whittiyer Thomas is asked to contact the Guys Hill Police at 876-994-3333, police 119 emergency number or the nearest police station."
    },
     
     {
       "id": 3,
       "Name": "Dwayne Barnaby",
       "Gender": "Male",
       "Age": "23-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/10/Dwayne-Barnaby-Web-495x400.jpg",
       "profile": "DWAYNE BARNABY\n\nTwenty-three-year-old Dwayne Barnaby of Grants Pen Avenue in Kingston has been missing since Thursday, October, 7.\n\nHe is of brown complexion, slim build and about 175 centimetres (5 feet 9 inches) tall.\n\nReports from the Grants Pen Police are that at about 10:00 a.m., Barnaby was last seen at the University of the West Indies in Kingston. When last seen he was dressed in a grey t-shit, blue jeans and a pair of red slippers.\n\nAnyone knowing the whereabouts of Dwayne Barnaby is being asked to contact the Grants Pen Police at 876- 755-1597, Police 119 emergency number or the nearest police station."
     },

     {
       "id": 4,
       "Name": "Garth Williams",
       "Gender": "Male",
       "Age": "23-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/10/Garth-Williams-Web-495x400.jpg",
       "profile": "GARTH WILLIAMS\n\nGarth Williams, 23, of Foster Lane in downtown in Kingston has been missing since Saturday, October 9.\n\nHe is of dark complexion, slim build and about 173 centimetres (5 feet 8 inches) tall.\n\nReports from the Gold Street Police are that about 9:00 a.m., Williams was last seen at home wearing a dark coloured top, navy blue shorts and a pair of black and white slippers. Efforts to contact him have proven futile.\n\nAnyone knowing the whereabouts of Garth Williams is being asked to contact the Gold Street Police at 876-922-3637, police 119 emergency number or the nearest police station."
     },
    {
      "id": 5,
      "Name": "Nina-Simone Anglin",
      "Gender": "Female",
      "Age": "14-years-old",
      "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/10/Nina-Simone-Anglin-Web-495x400.jpg",
      "profile": "NINA-SIMONE ANGLIN\n\nAn Ananda Alert has been activated for 14-year-old Nina-Simone Anglin of Charisma Way, St. Catherine who has been missing since Friday, October 08.\n\nShe is of dark complexion, medium build and about 165 centimetres (5 feet 5 inches) tall.\n\nReports from the Police are that about 3:00 p.m., Nina-Simone was last seen in her community dressed in a peach and white sweat top, blue jeans and a pair of slippers. She has not been seen or heard from since.\n\nAnyone knowing the whereabouts of Nina-Simone Anglin is being asked to contact the Waterford Police at 876- 988-1763 Police 119 emergency number of the nearest police station."
    },

    {
      "id": 6,
      "Name": "Courtney Bethune",
      "Gender": "Male",
      "Age": "35-years-old",
      "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/10/Courtney-Bethune-Web-495x400.jpg",
      "profile":  "COURTNEY BETHUNE\n\nThirty-five-year-old Courtney Bethune of Melbrook Heights, Harbour View, Kingston 17 has been missing since Friday, October 8.\n\nHe is of dark completion, stout build, about 173 centimetres (5 feet 8 inches) tall and has tattoos with one located to the top of his left palm.\n\nReports from the Harbour View Police are that about 3:00 p.m., Courtney was last seen at home wearing black jeans, a black t-shirt and black Air Force sneakers. He has not been heard from since.\n\nAnyone knowing the whereabouts of Courtney Bethune is being asked to contact the Harbour View Police at 876-928-6001, Police 119 emergency number or the nearest police station."
    },

    {
       "id": 7,
       "Name": "Timmera Cargill",
       "Gender": "Female",
       "Age": "13-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/10/Timmera-Cargill-Web-495x400.jpg",
       "profile":  "TIMMERA CARGILL\n\nAn Ananda Alert has been activated for 13-year-old Timmera Cargill, otherwise called ‘Tims’, of King Street, Spanish Town, St. Catherine who has been missing since Friday, October 08.\n\nShe is of dark complexion, slim build and about 160 centimetres (5 feet 3 inches) tall.\n\nReports from the Spanish Town Police are that about 9:20 a.m., Timmera was last seen at home wearing a sleeveless dress and a pair of multi-coloured slippers. She has not been heard from since.\n\nAnyone knowing the whereabouts of Timmera Cargill is being asked to contact the Spanish Town Police at (876) 984-2305, Police 119 emergency number or the nearest Police Station."
    },
     
     {
       "id": 8,
       "Name": "Kimberly Smith",
       "Gender": "Female",
       "Age": "16-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/10/Kimberly-Smith-Web-495x400.jpg",
       "profile": "KIMBERLY SMITH\n\nAn Ananda Alert has been activated for 16-year-old Kimberly Smith of Hibiscus Drive, Gregory Park in St.Catherine. She has been missing since Wednesday, October 06.\n\nShe is of dark complexion, medium build and about 152 centimetres (5 feet) tall.\n\nReports from the Police are that about 10:00 a.m., Kimberly was last seen in her community wearing a white blouse, black tights and a pair of red and black slippers. She has not been heard from since.\n\nAnyone knowing the whereabouts of Kimberly Smith is being asked to contact the Caymanas Police at 876- 988-1719, Police 119 emergency number of the nearest police station."
     },

     {
       "id": 9,
       "Name": "Rasheda Hart",
       "Gender": "Female",
       "Age": "16-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/10/Rasheda-Hart-Web-495x400.jpg",
       "profile": "RASHEDA HART\n\nAn Ananda Alert has been activated for 16-year-old Rasheda Hart of Gutters district, Granville, St. James who has been missing since Tuesday, October 05.\n\nShe is of dark complexion, slim build and about 163 centimetres (5 feet 4 inches) tall.\n\nReports from the Granville Police are that Rasheda was last seen in her community. Her mode of dress at the time she went missing is unknown. She has not been heard from since.\n\nAnyone knowing the whereabouts of Rasheda Hart is being asked to contact the Granville Police at (876)952-3337, Police 119 emergency number or the nearest police station."
      },

     {
       "id": 10,
       "Name": "Dwayne Campbell",
       "Gender": "Male",
       "Age": "42-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/10/Dwayne-Campbell-Web-495x400.jpg",
       "profile": "DWAYNE CAMPBELL\n\nForty-two-year-old Dwayne Campbell a security guard of St. John’s Road, Spanish Town, St. Catherine has been missing since February.\n\nHe is of brown complexion, slim build and about 182 centimetres (5 feet 9 inches) tall.\n\nReports from the Spanish Town Police are that Campbell was last seen some time in February. His mode of dress at the time he went missing is unknown.\n\nAnyone knowing the whereabouts of Dwayne Campbell is being asked to contact the Spanish Town Police at 876-984-2305, Police 119 emergency number or the nearest police station."
     },
           
     {
       "id": 11,
       "Name": "Jacqueline Hepburn",
       "Gender": "Female",
       "Age": "51-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/10/Jacqueline-Hepburn-Web-495x400.jpg",
       "profile": "JACQUELINE HEPBURN\n\nThe Bridgeport Police are seeking your help to find 51-year-old Jacqueline Hepburn of George Avenue, Edgewater in St. Catherine, who has been missing since Friday, October 1.\n\nShe is of brown complexion, slim build and is about 152 centimetres (5 feet) tall.\n\nReports are that Hepburn was last seen at home about 7:00 a.m., wearing a white blouse, black jeans and a pair of black slippers. She has not been heard from since.\n\nAnyone knowing the whereabouts of Jacqueline Hepburn is asked to call the Bridgeport Police at 876-988-2697, police 119 emergency number or the nearest police station."  
     },

     {
       "id": 12,
       "Name": "Daneel Grey",
       "Gender": "Female",
       "Age": "22-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/10/Daneel-Grey-Web-495x400.jpg",
       "profile": "DENEEL GREY\n\nTwenty-two-year-old Deneel Grey of Barbados Avenue, Cornwall Courts in St. James has been missing since Wednesday, September 29.\n\nShe is of dark complexion, slim build and is about 152 centimetres (5 feet) tall.\n\nReports from the Montego Bay Police are that Grey was last seen at home dressed in a blue long-sleeved shirt, green skirt and a pair of black shoes. Efforts made to contact her have proven futile.\n\nAnyone knowing the whereabouts of Deneel Grey is being asked to contact the Montego Bay Police at 876-684-9080, police 119 emergency number or the nearest police station." 
     },
           
     {
       "id": 13,
       "Name": "Rihanna Smith",
       "Gender": "Female",
       "Age": "14-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/10/Rihanna-Smith-Web-495x400.jpg",
       "profile": "RIHANNA SMITH\n\nAn Ananda Alert has been activated for 14-year-old Rihanna Smith otherwise called ‘Riree’, of Waterway Avenue, Medzgar Gardens in St. Thomas who has been missing since Friday, October 01.\n\nShe is of dark complexion, slim build and about 168 centimetres (5 feet 6 inches) tall.\n\nReports from the Morant Bay Police are that about 9:50 a.m., Rihanna was last seen home dressed in a blue shirt, light blue jeans and a pair of white sneakers. She has not been heard from since.\n\nAnyone knowing the whereabouts of Rihanna Smith is asked to contact the Morant Bay Police at (876)982-2233, police 119 emergency number or the nearest police station."
     },
           
     {
       "id": 14,
       "Name": "Kimoy Forbes",
       "Gender": "Female",
       "Age": "16-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/10/Kimoy-Forbes-Web-495x400.jpg",
       "profile": "KIMOY FORBES\n\nAn Ananda Alert has been activated for 16-year-old Kimoy Forbes of McNeiland, Little London, Westmoreland who has been missing since Thursday, September 30.\n\nShe is of dark complexion, stout build and 163 centimetres (5 feet 4 inches) tall.\n\nReports from the Little London Police are that Kimoy was last seen home dressed in a green striped dress and a pair of black slippers. She has not been heard from since.\n\nAnyone knowing the whereabouts of Kimoy Forbes is being asked to contact the Little London Police at (876)955-7449, Police 119 emergency number or the nearest police station."
     },

     {
       "id": 15,
       "Name": "Paulene Williams",
       "Gender": "Female",
       "Age": "Unknown",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/10/Paulene-Williams-Web-495x400.jpg",
       "profile": "PAULENE WILLIAMS\n\nPaulene Williams, otherwise called ‘Angella’, of Penwood Road, Kingston 11 has been missing since Monday, September 27.\n\nShe is of dark complexion, medium build and about 160 centimetres (5 feet 3 inches) tall.\n\nReports from the Olympic Gardens Police are that about 4:00 p.m., Williams was last seen in Bay Farm Villas, Kingston 11 wearing a short dress. Efforts to contact her have proven futile.\n\nAnyone knowing the whereabouts of Paulene Williams is being asked to contact the Olympic Gardens Police at (876)923-5468, police 119 emergency number or the nearest police station."
     },
     {
       "id": 16,
       "Name": "Tobore Neish",
       "Gender": "Female",
       "Age": "15-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/10/Tobore-Neish-Web-495x400.jpg",
       "profile": "TOBORE NEISH\n\nAn Ananda Alert has been activated for 15-year-old Tobore Neish of old Braeton, Portmore, St. Catherine who has been missing since Friday, October 1.\n\nShe is of brown complexion, slim build and about 157 centimetres (5 feet 2 inches) tall.\n\nReports from the Portmore Police are that about 11:20 a.m., Tobore was last seen at a supermarket on Braeton Road, Portmore, St. Catherine wearing a black sleeveless blouse, blue tights and a pair of black slippers. She has not been heard from since.\n\nAnyone knowing the whereabouts of Tobore Neish is asked to contact the Portmore Police at 876-989-8422, Police 119 emergency number or the nearest police station."
     },

     {
       "id": 17,
       "Name": "Larry Taylor",
       "Gender": "Male",
       "Age": "78-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/10/Larry-Taylor-Web-495x400.jpg",
       "profile": "LARRY TAYLOR\n\nSeventy-eight-year-old Larry Taylor of Breaton Phase 2, Portmore, St. Catherine has been missing since Saturday, September 04.\n\nHe is of dark complexion, medium build and is about 180 centimetres (5 feet 11 inches) tall with grey hair.\n\nReports from the Central Village Police are that about 12:00 a.m., Robinson was last seen at home wearing a red t-shirt, blue jeans shorts and a pair of black slippers. Efforts to contact him have proven futile.\n\nAnyone knowing the whereabouts of Larry Taylor is asked to contact the Central Village Police at (876) 984-2644, Police 119 emergency number the nearest Police Station."
     },

     {
       "id": 18,
       "Name": "Abi-Gayle Binns",
       "Gender": "Female",
       "Age": "16-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/10/Abi-Gayle-Binns-Web-495x400.jpg",
       "profile": "ABI-GAYLE BINNS\n\nAn Ananda Alert has been activated for 16-year-old Abi-Gayle Binns, of Mocho Road, Mocho, Clarendon who has been missing since Thursday, September 30.\n\nShe is of brown complexion, medium build, and about 152 centimetres (5 feet) tall.\n\nReports from the Four Paths Police are that about 3:00 p.m., Abi-Gayle was last seen at home wearing a burgundy dress and pair of black shoes. She has not been heard from since.\n\nAnyone knowing the whereabouts of Abi-Gayle Binns is being asked to contact the Four Paths Police at 876-987-0429, Police 119 emergency number of the nearest police station."
     },
     {
       "id": 19,
       "Name": "Kevin Brown",
       "Gender": "Male",
       "Age": "42-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/09/Kevin-Brown-Web-495x400.jpg",
       "profile": "KEVIN BROWN\n\nForty-two-year-old Kevin Brown, a security guard of Ramble district, Yallahs in St. Thomas has been missing since Saturday, August 7.\n\nHe is of dark complexion, medium build and is about 180 centimetres (5 feet 11 inches) tall.\n\nReports from the Yallahs Police are that about 10:30 a.m., Brown was last seen at work in Mount Sinai district in the parish dressed in a grey shirt, blue pants and a pair of black sneakers. Efforts made to contact him have proven futile.\n\nAnyone knowing the whereabouts of Kevin Brown is being asked to contact the Yallahs Police at 876-982-5075, Police 119 emergency number or the nearest police station."
     },

     {
       "id": 20,
       "Name": "Theresa Risden",
       "Gender": "Female",
       "Age": "16-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/09/Theresa-Risden-Web-495x400.jpg",
       "profile": "THERESA RISDEN\n\nAn Ananda Alert has been activated for 16-year-old Theresa Risden of Beckford Kraal, Clarendon who has been missing since Monday, September 13.\n\nShe is of dark complexion, slim build and is about 165 centimetres (5 feet 5 inches) tall.\n\nReports from the May Pen Police are that about 1:00 p.m., Theresa was last seen at home dressed in a burgundy blouse and a pair of pink shorts. Efforts made to contact her have proven futile.\n\nAnyone knowing the whereabouts of Theresa Risden is asked to contact the May Pen Police at 876-986-2208, Police 119 emergency number or the nearest Police Station."
     },

    {
      "id": 21,
      "Name": "Fabian Robinson",
      "Gender": "Male",
      "Age": "40-years-old",
      "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/09/Fabian-Robinson-Web-495x400.jpg",
      "profile": "FABIAN ROBINSON\n\nForty-year-old Fabian Robinson, otherwise called ‘Birdy’, of Barnett Oval, Montego Bay in St. James has been missing since Thursday, September 16.\n\nHe is of dark complexion, slim build and is about 170 centimetres (5 feet 7 inches) tall.\n\nReports from the Barnett Street Police are that about 8:30 a.m., Robinson was last seen at home wearing a blue shirt, jeans and a pair of red slippers. Efforts to contact him have proven futile.\n\nAnyone knowing the whereabouts of Fabian Robinson is asked to contact the Barnett Street Police at (876)952-9333, Police 119 emergency number the nearest Police Station."
    },

    {
      "id": 22,
      "Name": "Delgardo Richards",
      "Gender": "Male",
      "Age": "14-years-old",
      "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/09/Delgardo-Richards-Web-495x400.jpg",
      "profile": "DELGARDO RICHARDS\n\nAn Ananda Alert has been activated for 14-year-old Delgardo Richards otherwise called ‘Denny’, of Waltham Park Road, Kingston 13 who has been missing since Wednesday, September 08.\n\nHe is of dark complexion, medium build and about 168 centimetres (5 feet 6 inches) tall.\n\nReports from the Hunts Bay Police are that about 3:00 p.m., Delgardo was last seen in Spanish Town in St. Catherine wearing a blue shirt, blue-and-white shorts and a pair of black slippers. He has not been heard from since.\n\nAnyone knowing the whereabouts of Delgardo Richards is asked to contact the Hunts Bay Police at 876-923-7111, police 119 emergency number or the nearest police station."
    },

    {
       "id": 23,
       "Name": "Shaniel McLean",
       "Gender": "Female",
       "Age": "14-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/09/Shaniel-McLean-Web-495x400.jpg",
       "profile": "SHANEIL MCLEAN\n\nAn Ananda Alert has been activated for 14-year-old Shaneil McLean of Simon Taylor Road, Kingston 11 who has been missing since Thursday, September 09.\n\nShe is of dark complexion, slim build and about 170 centimetres (5 feet 7 inches) tall.\n\nReports from the Hunts Bay Police are that about 11:00 a.m., Shaneil was last seen at home wearing a black-and-white long sleeve dress and a pair of black slippers. She has not been heard from since.\n\nAnyone knowing the whereabouts of Shaneil McLean is asked to contact the Hunts Bay Police at 876-923-7111, police 119 emergency number or the nearest police station."
    },
     
     {
       "id": 24,
       "Name": "Lakeisha Campbell",
       "Gender": "Female",
       "Age": "37-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/09/Lakeisha-Campbell-Web-495x400.jpg",
       "profile": "LAKEISHA CAMPBELL\n\nThirty-seven-year-old Lakeisha Campbell, otherwise called ‘Kakeisha’,of Azalia Way, Eltham Park, Spanish Town, St. Catherine has been missing since Tuesday, September 07.\n\nShe is of brown complexion, medium build and about 168 centimtres( 5 feet 6 inches) tall.\n\nReports from the Spanish Town Police are that at 8:00 a.m., Campbell was last seen in Central Village, St. Catherine wearing a brown floral dress and blue-and-white slippers. Efforts to contact her have proven futile.\n\nAnyone knowing the whereabouts of Lakeisha Cambell is being asked to contact the Spanish Town Police at (876) 984-2305, Police 119 emergency number or the nearest Police Station."
     },

     {
       "id": 25,
       "Name": "Anthony Swaby",
       "Gender": "Male",
       "Age": "70-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/09/Anthony-Swaby-Web-495x400.jpg",
       "profile": "ANTHONY SWABY\n\nSeventy-year-old Anthony Swaby of Park Lane, Kingston 19 has been missing since Monday, September 06.\n\nHe is of dark complexion, slim build and is about 170 centimetres (5 feet 7 inches) tall.\n\nReports from the Constant Spring Police are that Swaby was last seen in his community. His mode of dress at the time he went missing is unknown. All efforts to contact him have proven futile.\n\nAnyone knowing the whereabouts of Anthony Swaby is asked to contact the Constant Spring  Police at 876-9241421, 119 emergency numbers or the nearest Police Station."
     },

     {
       "id": 26,
       "Name": "Chevon Dixon",
       "Gender": "Male",
       "Age": "16-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/09/Chevon-Dixon-Web-495x400.jpg",
       "profile": "CHEVON DIXON\n\nAn Ananda Alert has been activated for 16-year-old Chevon Dixon of Almando Terrace in St. Andrew who has been missing since Sunday, September 05.\n\n \n\nHe is of dark complexion, slim build and is about 172 centimetres (5 feet 8 inches) tall.\n\n \n\nReports from the Duhaney Park Police are that Chevon was last seen at home about 5:00 p.m., wearing blue shorts and a pair of black slippers. All attempts to contact him have proven futile.\n\n \n\nAnyone knowing the whereabouts of Chevon Dixon is asked to contact the Duhaney Park Police at (876) 933-4280, the police 119 emergency number or the nearest police station.\n\n "
     },
           
     {
       "id": 27,
       "Name": "Andrew Richards",
       "Gender": "Male",
       "Age": "54-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/09/Andrew-Richards-Web-495x400.jpg",
       "profile": "ANDREW RICHARDS\n\nFifty-four-year-old Andrew Richards of Blissett Avenue, Kingston 20 has been missing since Saturday, September 04.\n\n \n\nHe is of dark complexion, slim build and about 188 centimetres ( 6 feet 2 inches) tall.\n\n \n\nReports from the Admiral Town Police are that about 4:00 p.m., Richards was last seen at the Kingston Public Hospital wearing  a white T-shirt, navy blue shorts and a pair of black sneakers. He has not been heard from since.\n\n \n\nAnyone knowing the whereabouts of Andrew Richards is being asked to contact the Admiral Town Police at (876)922-6243 , Police 119 emergecny number or the nearest Police Station."
     },

     {
       "id": 28,
       "Name": "Tiffany Jervis",
       "Gender": "Female",
       "Age": "14-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/09/Tiffany-Jervis-Web-495x400.jpg",
       "profile": "TIFFANY JERVIS\n\nAn Ananda Alert has been activated for 14-year-old Tiffany Jervis otherwise called ‘Chin’, of Burnt Ground in St. Andrew who has been missing since Friday, September 03.\n\nShe is of brown complexion, stout build and about 163 centimetres (5 feet 4 inches) tall.\n\nReports from the Red Hills Police are that Tiffany was last seen at home about 12:00 p.m., wearing a purple tunic, grey blouse and a pair of black shoes. She has not been heard from since.\n\nAnyone knowing the whereabouts of Tiffany Jervis is asked to contact the Red Hills Police at 876-945-8270, Police 119 emergency number or the nearest police station."
     },
           
     {
       "id": 29,
       "Name": "Kenroy Cunningham",
       "Gender": "Male",
       "Age": "13-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Kenroy-Cunningham-Web-495x400.jpg",
       "profile": "KENROY CUNNINGHAM\n\nAn Ananda Alert has been activated for 13-year-old Kenroy Cunningham of Bios Content in Old Harbour, St. Catherine who has been missing since Monday, August 30.\n\nHe is of brown complexion, stout build and about 163 centimetres (5 feet 4 inches) tall.\n\nReports from the Old Harbour Police are that Kenroy was last seen at home about 2:30 p.m., wearing a brown shirt and a pair of blue jeans shorts. He has not been heard from since.\n\nAnyone knowing the whereabouts of Kenroy Cunningham is asked to contact the Old Harbour Police at 876-983-2255, Police 119 emergency number or the nearest police station."
     },
           
     {
       "id": 30,
       "Name": "Christal Keane",
       "Gender": "Female",
       "Age": "16-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Christal-Keane-Web-495x400.jpg",
       "profile": "CHRISTAL KEANE\n\nAn Ananda Alert has been activated for 16-year-old Christal Keane of Chateau district, Clarendon who has been missing since Wednesday, August 25.\n\nShe is of brown complexion, medium build and about 168 centimetres (5 feet 6 inches) tall.\n\nReports from the May Pen Police are that Christal was last seen at home. Her mode of dress at the time she went missing is unknown. All efforts to contact her have proven futile.\n\nAnyone knowing the whereabouts of Christal Keane is being asked to contact the May Pen Police at (876) 986-2208, Police 119 emergency number or the nearest police Station."
     },

     {
       "id": 31,
       "Name": "Kara Campbell",
       "Gender": "Female",
       "Age": "15-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Kara-Campbell-Web-495x400.jpg",
       "profile": "KARA CAMPBELL\n\nAn Ananda Alert has been activated for 15-year-old Kara Campbell of Wellside Drive, Kingston  11 who has been missing since Friday, August 27.\n\nShe is of dark complexion, medium build and about 152 centimetres (5 feet) tall.\n\nReports from the Olympic Gardens Police are that about 10:30 p.m., Kara was last seen at home, wearing a pink crop top, and a black romper and a pair of slippers. She has not been heard from since.\n\nAnyone knowing the whereabouts of Kara Campbell is being asked to contact the Half Way Tree Police at 876-923-5468, Police 119 emergency number or the nearst police station." 
     },
     {
       "id": 32,
       "Name": "Jinel Jennings",
       "Gender": "Female",
       "Age": "16-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Jinel-Jennings-Web-495x400.jpg",
       "profile": "JINEL JENNINGS\n\nAn Ananda Alert has been activated for 16-year-old Jinel Jennings of Red Hills Road, Kingston who has been missing since Wednesday, August 25.\n\nShe is of brown complexion, slim build and about 157 centimetres (5 feet 2 inches) tall.\n\nReports from the Half Way Tree Police are that about 7:00 a.m., Jinel was last seen at home however her mode of dress at the time she went missing is unknown. She has not been heard from since.\n\nAnyone knowing the whereabouts of Jinel Jennings is being asked to contact the Half Way Tree Police at 876-926-8184, Police 119 emergency number or the nearest police station."
     },

     {
       "id": 33,
       "Name": "Anthony Hayles",
       "Gender": "Male",
       "Age": "31-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Anthony-Hayles-495x400.jpg",
       "profile": "ANTHONY HAYLES\n\nThirty-one-year-old Anthony Hayles, a labourer of Red Hassell Lane, Port Antonio in Portland  has been missing since Thursday, August 19.\n\nReports from the Port Antonio Police are that Hayles left home for an undisclosed location and did not return. When last seen he was wearing a multi-coloured jersey, a blue jeans and a pair of black-and-white slippers.\n\nAnyone knowing the whereabouts of Anthony Hayles is being asked to contact the Port Antonio Police at 876-322-9368, Police 119 emergency number or the nearest Police Station."
     },

     {
       "id": 34,
       "Name": "Sabrina Graham",
       "Gender": "Female",
       "Age": "24-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Sabrina-Graham-Web-495x400.jpg",
       "profile": "SABRINA GRAHAM\n\nTwenty-four-year-old Sabrina Graham of Rodney Road in Kingston has been missing since Saturday, August 21.\n\nShe is of dark complexion, slim build, about 170 centimetres (5 feet 7 inches) tall.\n\nReports are that Graham was last seen in her community. She has not been heard from since. Her mode of dress at the time she went missing is unknown.\n\nAnyone knowing the whereabouts of Sabrina Graham is asked to contact the Hunts Bay Police at 876-923-7111, Police 119 emergency number or the nearest police station."   },
     {
       "id": 35,
       "Name": "Christina Pinnock",
       "Gender": "Female",
       "Age": "14-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Christina-Pinnock-Web-495x400.jpg",
       "profile": "CHRISTINA PINNOCK\n\nAn Ananda Alert has been activated for 14-year-old Christina Pinnock of Waltham Park Road, Kingston 11 who has been missing since Thursday, August 19.\n\nShe is of brown complexion, stout build and about 167 centimetres (5 feet 6 inches) tall.\n\nReports from the Half Way Tree Police are that about 4:00 p.m., Christiana was last seen in Black River, St. Elizabeth wearing a blue blouse, blue jean shorts and multi-coloured slippers. She has not been heard from since.\n\nAnyone knowing the whereabouts of Christina Pinnock is being asked to contact the Half Way Tree Police at 876- 926-8184, Police 119 emergency number or the nearst police station."
     },

     {
       "id": 36,
       "Name": "Serina Williams",
       "Gender": "Female",
       "Age": "14-years-old",
       "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Serina-Williams-Web-495x400.jpg",
       "profile": "SERINA WILLIAMS\n\nAn Ananda Alert has been activated for 14-year-old Serina Williams of Waltham Park Road, Kingston 11 who has been missing since Thursday, August 19.\n\nShe is of brown complexion, slim build and about 157 centimetres (5 feet 2 inches) tall.\n\nReports from the Half Way Tree Police are that about 4:00 p.m., Serina was last seen in Black River, St. Elizabeth wearing a blue blouse, black jean shorts and multi-coloured slippers. She has not been heard from since.\n\nAnyone knowing the whereabouts of Serina Pinnock is being asked to contact the Half Way Tree Police at 876- 926-8184, Police 119 emergency number or the nearest police station."
     },

       {
        "id": 37,
        "Name": "Kimberly McCalla",
        "Gender": "Female",
        "Age": "19-years-old",
        "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Kimberly-McCalla-Web-495x400.jpg",
        "profile": "KIMBERLY MCCALLA\n\nNineteen-year-old Kimberley McCalla, of Windsor Road in Spanish Town, St. Catherine has been missing since Wednesday, August 17.\n\nShe is of dark complexion, medium build and sports a brown curly hairstyle.\n\nReports are that McCalla was released from the hospital and has not been heard from since. She is wheelchair bound with her left leg amputated and she has several scars on her left hand. McCalla’s mode of dress at the time she went missing is unknown.\n\nAnyone knowing the whereabouts of Kimberly McCalla is asked to contact the Mona Police Post at 876-837- 7192, Police 119 emergency number or the nearest police station."
       },

      {
        "id": 38,
        "Name": "Danniel Annon",
        "Gender": "Female",
        "Age": "19-years-old",
        "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Danniel-Annon-Web-495x400.jpg",
        "profile": "DANNIEL ANNON\n\nNineteen-year-old Danniel Annon, of Park Lane, Red Hills Road, Kingston 20 has been missing since Thursday, July 15.\nShe is of a brown complexion, medium build and 170 centimeters (5 feet 7 inches) tall.\n\nReports are that Annon was last seen in the Seaview Gardens community, about 9:30 p.m. Her mode of dress at the time she went missing is unknown and all efforts to contact her have proven futile.\n\nAnyone knowing the whereabouts of Danniel Annon is asked to contact the Seaview Gardens Police at 876-945-8270, Police 119 emergency number or the nearest police station."
      },

      {
         "id": 39,
         "Name": "Leroy Gray",
         "Gender": "Male",
         "Age": "64-years-old",
         "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Leroy-Gray-Web-495x400.jpg",
         "profile": "LEROY GRAY\n\nSixty-four-year-old Leroy Gray, of Annotto Bay, St. Mary has been missing since Friday, August 13.\n\nHe is of dark complexion, slim build and about 165 centimetres 5 feet 5 inches tall.\n\nReports from the Annotto Bay Police are that about10:15 p.m., Gray was last seen in Annotto Bay wearing a grey merino and a shorts. All efforts to locate him have proven futile.\n\nAnyone knowing the whereabouts of Leroy Gray is being asked to contact the Annotto Bay Police at 876-996-2244, police 119 emergency number or the nearest police station."
      },
       
       {
         "id": 40,
         "Name": "Rihana Clarke",
         "Gender": "Female",
         "Age": "14-years-old",
         "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Rihana-Clarke-Web-495x400.jpg",
         "profile": "RIHANNA CLARKE\n\nAn Ananda Alert has been activated for 14-year-old Rihanna Clarke of Isabella Road in St. James who has been missing since Monday, August 9.\n\nShe is of dark complexion, slim build and is about 155 centimetres (5 feet 4 inches) tall.\n\nReports from the Mount Salem Police are that Rihanna was last seen at home dressed in a red and black dress and a pair of slippers. All attempts to contact her have failed.\n\nAnyone knowing the whereabouts of Rihanna Clarke is asked to contact the Mount Salem Police at876-952-3572, police 119 emergency number or the nearest police station."
       },

       {
         "id": 41,
         "Name": "Nicolisa Rose",
         "Gender": "Female",
         "Age": "18-years-old",
         "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Nicolisa-Rose-Web-495x400.jpg",
         "profile": "NICOLISA ROSE\n\nEighteen-year-old Nicolisa Rose of Fairfield Avenue in St. James has been missing since Monday, July 26.\n\nShe is of dark complexion, slim build and is about 157 centimetres (5 feet 3 inches) tall.\n\nReports from the Irwin Police Post are that Nicolisa was last seen at home dressed in a black blouse, blue shorts and a pair of slippers. All attempts to contact her have failed.\n\nAnyone knowing the whereabouts of Nicolisa Rose is asked to contact the Montego Bay Police at 876-952-8626, police 119 emergency number or the nearest police station."
       },

       {
         "id": 42,
         "Name": "Kimberly Barnes",
         "Gender": "Female",
         "Age": "17-years-old",
         "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Kimberly-Barnes-Web-495x400.jpg",
         "profile": "KIMBERLY BARNES\n\nAn Ananda Alert has been activated for 17-year-old Kimberly Barnes, otherwise called ‘Kim’, of Red Hills, St. Andrew, who has been missing since Saturday, August 14.\n\nShe is of brown complexion, slim build and is about 158 centimetres (5 feet) tall.\n\nReports are that Barnes was last seen in her community about 2:00 p.m., wearing a black blouse, shorts and a pair of black slippers. She has not been heard from since.\n\nAnyone knowing the whereabouts of Kimberly Barnes is being asked to contact the Constant Spring Police at 876-924-1421, police 119 emergency number or the nearest police station."
       },
             
       {
         "id": 43,
         "Name": "Shakira London",
         "Gender": "Female",
         "Age": "15-years-old",
         "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Shakira-London-Web-Real-495x400.jpg",
         "profile": "SHAKIRA LONDON\n\nAn Ananda Alert has been activated for 15-year-old Shakira London of Morant Road, Morant Bay, St. Thomas who been missing since Thursday, August 12. She is of dark complexion, slim build and about 170 centimetres (5 feet 7 inches) tall Reports from the Morant Bay Police are that about 10:00 a.m., Shakira was last seen leaving home. Her mode of dress at the time she went missing is unknown. All efforts to contact her have proven futile. Anyone knowing the whereabouts of Shakira London is asked to contact the Morant Bay Police at 876-982-2233, police 119 emergency number or the nearest police station."
       },

       {
         "id": 44,
         "Name": "Kelly Campbell",
         "Gender": "Female",
         "Age": "12-years-old",
         "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Kelly-Campbell-Web-495x400.jpg",
         "profile": "KELLY CAMPBELL\n\nA High Alert has been activated for 12-year-old Kelly Campbell, otherwise called ‘Kasacy’ of Balmagie Avenue in Kingston 11 has been missing Sunday, August 08.\n\nShe is of dark complexion, slim build, and is about 155 centimetres (5feet 4 inches) tall.\n\nReports from the Olympic Gardens Police are that Campbell was last seen at home wearing a white blouse, pink tights, and a pair of black slippers. All attempts to contact her have failed.\n\nAnyone knowing the whereabouts of Kelly Campbell is asked to contact the Olympic Gardens Police at 876-923 5468, Police 119emergency number, or the nearest police station."
       },
             
       {
         "id": 45,
         "Name": "Deidre Taylor",
         "Gender": "Female",
         "Age": "29-years-old",
         "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Deidre-Taylor-Web-495x400.jpg",
         "profile": "DEIDRE TAYLOR\n\nTwenty-nine-year-old Deidre Taylor of 8 Miles, Bull Bay, St. Andrew has been missing since Wednesday, August 11.\n\nShe is of brown complexion, slim build and about 167 centimetres (5 feet 6 inches) tall.\n\nReports from the Bull Bay Police are that about 11:00 p.m., Taylor was last seen at home wearing a floral night gown. She has not been heard from since.\n\nAnyone knowing the whereabouts of Deidre Taylor is being asked to contact the Bull Bay Police at 876-967-6810, Police 119 emergency number or the nearest police station."
       },
             
       {
         "id": 46,
         "Name": "Orlandi Miller",
         "Gender": "Female",
         "Age": "3-years-old",
         "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Orlandi-Miller-Web-495x400.jpg",
         "profile": "ORLANDI MILLER\n\nDetectives assigned to Westmoreland Division are renewing their appeal to the public for assistance in locating Orlandi Miller of Pee Wee Lane, West End in the parish who has been missing since March 2017.\n\nOrlandi, who was three years old at the time she went missing, is of dark complexion, slim build and was about 3 feet tall. \n\nThe decomposing body of Orlandi Miller’s mother—Shantel Dyer—was found in a makeshift grave inside a house on June 7, 2017. The child has not been seen since.\n\nAnyone with information that may be able to assist the investigators is asked to contact the Negril Police at 876-957-4268, police 119 emergency number or the nearest police station."
       },

       {
         "id": 47,
         "Name": "Kasheama Donaldson",
         "Gender": "Female",
         "Age": "16-years-old",
         "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Kasheama-Donaldson-495x400.jpg",
         "profile": "KASHEAMA DONALDSON\n\nSixteen-year-old Kasheama Donaldson otherwise called, ‘Mun Mun’ of Canary Avenue in Kingston 11 has been missing Tuesday, August 10.\n\n She is of dark complexion, slim build and is about 165 centimetres (5 feet 6 inches) tall.\n\nReports from the Hunts Bay Police are that Donaldson was last seen at home wearing a green merino, black shorts and a pair of blue slippers. All attempts to contact her have failed.\n\nAnyone knowing the whereabouts of Donaldson is asked to contact the Hunts Bay Police at\n\n 876-923-7111, Police 119 emergency number or the nearest police station."
       },
       {
         "id": 48,
         "Name": "Andre Green",
         "Gender": "Male",
         "Age": "42-years-old",
         "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Andre-Green-Web-495x400.jpg",
         "profile": "ANDRE GREEN\n\nForty-two-year-old Andre Green, a mason of Johnson Pen, Spanish Town, St. Catherine has been missing since Saturday, July 3.\n\nHe is of dark complexion, medium build medium build and is 182 centimetres (6 feet) tall.\n\nReports from the Spanish Town Police are that Green was last seen at home wearing a red shirt, black and white pants and a pair of white sneakers. Efforts to contact him have proven futile.\n\nAnyone knowing the whereabouts of Andre Green is being asked to contact the Spanish Town Police at (876) 984-2305, Police 119 emergency number or the nearest Police Station."
       },

       {
         "id": 49,
         "Name": "Ethnal Thomas",
         "Gender": "Male",
         "Age": "78-years-old",
         "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Ethnal-Thomas-Web-495x400.jpg",
         "profile": "ETHNAL THOMAS\n\nSeventy-eight-year-old Ethnal Thomas of Steton Drive, Old Harbour, St. Catherine has been missing since Monday, August 09.\n\nHe is of brown complexion, slim build and about 165 centimetres (5 feet 5 inches) tall.\n\nReports from the Old Harbour Police are that about 12:30 p.m., Thomas was last seen at home wearing a blue shirt, blue pants and a pair of black shoes. He has not been seen since.\n\nAnyone knowing the whereabouts of Ethnal Thomas is being asked to contact the Old Harbour Police at (876)983-2255, police 119 emergency number or the nearest police station."
       },

       {
         "id": 50,
         "Name": "Steven Williams",
         "Gender": "Male",
         "Age": "33-years-old",
         "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Steven-Williams-Web-495x400.jpg",
         "profile": "STEVEN WILLIAMS\n\nThirty-three-year-old Steven Williams of Old Harbour Road, Spanish Town, St. Catherine has been missing since Wednesday, August 04.\n\nHe is dark complexion, slim build and about 165 centimetres (5 feet 5 inches) tall.\n\nReports from the Spanish Town Police are that about 11:00 a.m., Williams was last seen at home wearing a blue T-shirt, blue distressed jeans and a pair of black Clarks shoes. Efforts to contact him have proven futile.\n\nAnyone knowing the whereabouts of Steven Williams is being asked to contact the Spanish Town Police at (876) 984-2305, Police 119 emergency number or the nearest Police Station."
       },
       {
         "id": 51,
         "Name": "Siddonie Smalling",
         "Gender": "Female",
         "Age": "14-years-old",
         "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Siddonie-Smalling-Web-495x400.jpg",
         "profile": "SIDDONIE SMALLING\n\nAn Ananda Alert has been activated for 14-year-old Siddonie Smalling of Glades View, Quarry Hill, St. Catherine who has been missing since Thursday, July 15.\n\nShe is of dark complexion, slim build and about 158 centimetres (5 feet 4 inches) tall.\n\nReports from the Spanish Town Police are that Siddonie was last seen at home wearing a multi-coloured dress. She has not been heard from since.\n\nAnyone knowing the whereabouts of Siddonie Smalling is being asked to contact the Spanish Town Police at 876-984-2305, Police 119 emergency number or the nearest police."
       },

       {
         "id": 52,
         "Name": "Xan Hepburn",
         "Gender": "Female",
         "Age": "13-years-old",
         "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Xan-Hepburn-Web-495x400.jpg",
         "profile": "XAN HEPBURN\n\nAn Ananda Alert has been activated for 13-year-old Xan Hepburn otherwise called ‘Xan’, of Love Lane, Kingston CSO who has been missing since Saturday, August 07.\n\nShe is of dark complexion, slim build and about 165 centimeters (5 feet 5 inches) tall.\n\nReports from the Fletchers’ Land Police are that about 9:30 a.m., Xan was last seen home and has not been heard from since. Her mode of dress at the time she went missing is unknown.\n\nAnyone knowing the whereabouts of Xan Hepburn is asked to contact the Fletcher’s Land Police at 876-922-2541, Police 119 emergency number or the nearest police station."
       },
         {
          "id": 53,
          "Name": "Excel Samuels",
          "Gender": "Male",
          "Age": "38-years-old",
          "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/08/Excel-Samuels-Web-495x400.jpg",
          "profile": "EXCEL SAMUELS\n\nThirty-eight-year-old Excel Samuels of Hannah Street, Kingston 4 has been missing since Thursday, August 05.\n\nHe is of dark complexion, medium build and about 175 centimetres (5 feet 9 inches) tall.\n\nReports from the Allman Town Police are that Samuels was last seen at home about 9:00 p.m., dressed in a blue floral short. Samuels who suffers from a mental illness has not been heard from since.\n\nAnyone knowing the whereabouts of Excel Samuels is asked to contact the Allman Town Police at 876-922-2842, police 119 emergency number or the nearest police station."
         },
 
        {
          "id": 54,
          "Name": "Athaliah Lancaster",
          "Gender": "Female",
          "Age": "16-years-old",
          "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/07/Athaliah-Lancaster-Web-495x400.jpg",
          "profile": "ATHALIAH LANCASTER\n\nAn Ananda Alert has been activated for 16-year-old Althaliah Lancaster of Portmore, St. Catherine who has been missing since Friday, July 23.\n\nShe is of dark complexion, medium build and is about 170 centimetres (5 feet 7 inches) tall.\n\nReports from the Bridgeport Police are that Althaliah was last seen at home. Her mode of dress at the time she went missing is unknown. Efforts to contact her have proven futile.\n\nAnyone knowing the whereabouts of Althaliah Lancaster is being asked to contact the Bridgeport Police at (876) 988-2697, Police 119 emergency number or the nearest Police Station."
        },
 
        {
           "id": 55,
           "Name": "Teena Morgan",
           "Gender": "Female",
           "Age": "16-years-old",
           "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/07/Teena-Morgan-Web-495x400.jpg",
           "profile": "TEENA MORGAN\n\nAn Ananda Alert has been activated for 16-year-old Teana Morgan of Tryall Gardens, Hopewell in Hanover who has been missing since Thursday, July 22.\n\nShe is of brown complexion, slim build and about 165 centimetres (5 feet 5 inches) tall.\n\nReports from the Sandy Bay Police are that about 3:00 p.m., Teana was last seen at home wearing a black tights and carrying a floral bag. All efforts to contact her have proven futile.\n\nAnyone knowing the whereabouts of Teana Morgan is being asked to contact the Sandy Bay Police at 876-953-5312, police 119 emergency number or the nearest police station."  
        },
         
         {
           "id": 56,
           "Name": "Kamal Smith",
           "Gender": "Male",
           "Age": "22-years-old",
           "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/07/Kamal-Smith-Web-495x400.jpg",
           "profile": "KAMAL SMITH\n\nTwenty-two-year-old Kamal Smith of Georges Street, Kingston CSO has been missing since Thursday, July 22.\n\nHe is of brown complexion, slim build and about 165 centimetres (5 feet 5 inches) tall.\n\nReports from the Central Police are that about 9:00 a.m., Smith was last seen at home wearing a pink-and-black T-shirt, purple shorts and a pair of black-and-white slippers. Efforts to contact him have proven futile.\n\nAnyone knowing the whereabouts of Kamal Smith is being asked to contact the Central Police at 876-922-8860, Police 119 emergency number or the nearest police station."
         },
 
         {
           "id": 57,
           "Name": "Julian Deveaux",
           "Gender": "Male",
           "Age": "50-years-old",
           "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/07/Julian-Deveaux-Web-495x400.jpg",
           "profile": "JULIAN DEVEAUX\n\nFifty-year-old Julian Deveaux, a Bahamian national has been missing since Thursday, March 23.\n\nHe is of dark complexion, medium build and about 152 centimetres (5 feet) tall.\n\nReports from the Port Royal Police are that about 6:30 p.m., Deveaux was last seen on Broad Street, Port Royal, Kingston 1 wearing a blue jeans and a pair of blue Wallabee Clarks. He has not been heard from since.\n\nAnyone knowing the whereabouts of Julian Deveaux is being asked to contact the Port Royal Police at 876-967-8068, Police 119 emergency number or the nearest police station."
         },
 
         {
           "id": 58,
           "Name": "Anecia & Ashlee-Ann Bennett",
           "Gender": "Female",
           "Age": "16-years-old & 14-years-old",
           "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/07/Anecia-Ashlee-Ann-Bennett-495x400.jpg",
           "profile": "ANECIA & ASHLEE-ANN BENNETT\n\nAn Ananda Alert has been activated for 16-year-old Anecia and 14-year-old Ashlee-Ann Bennett both of Font Hill district, Trinityville in St. Thomas who has been missing since Sunday, July 19.\n\nAnecia is of brown complexion, slim build and about 178 centimetres (5 feet 10 inches) tall; while Ashlee-Ann is of dark complexion, slim build and about 165 centimetres (5 feet 5 inches) tall.\n\nReports from the Trinityville Police are that about 5:00 p.m., Anecia and Ashlee-Ann were last seen at home. Anecia was wearing a brown sweater, jeans pants and a pair of brown slippers while Ashlee-Ann was wearing a pink blouse, grey and black sweater and pair of blue jeans. All efforts to locate them have proven futile.\n\nAnyone knowing the whereabouts of Anecia and Ashlee-Ann Bennett is asked to contact the Trinityville Police at 876-982-7392, Police 119 emergency number or the nearest police station."
         },
               
         {
           "id": 59,
           "Name": "Latoya McKenzie",
           "Gender": "Female",
           "Age": "14-years-old",
           "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/07/Latoya-McKenzie-Web-495x400.jpg",
           "profile": "LATOYA MCKENZIE\n\nAn Ananda Alert has been activated 14-year-old Latoya McKenzie of Christian Pen, Portmore in St. Catherine who has been missing since Friday, July 16.\n\nShe is of dark complexion, slim build and about 135 centimetres (4 feet 5 inches) tall.\n\nReports from the Caymanas Police are that about 12:00 p.m., Latoya was last seen at home wearing a white blouse, pink shorts, and a pair of brown slippers. She has not been heard from since.\n\nAnyone knowing the whereabouts of Latoya McKenzie is being asked to contact the Caymanas Police at (876) 988-1719, police 119 emergency number or the nearest police station."
         },
 
         {
           "id": 60,
           "Name": "Maurice Dunbar",
           "Gender": "Male",
           "Age": "44-years-old",
           "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/07/Maurice-Dunbar-Web-495x400.jpg",
           "profile": "MAURICE DUNBAR\n\nForty-four-year-old Maurice Dunbar otherwise called ‘Nose’, of Windsor Heights, Central Village in St. Catherine has been missing since Monday, July 12.\n\nHe is of dark complexion, slim build and about 183 centimetres (6 feet) tall.\n\nReports from the Central Village Police are that about 6:30 p.m., Dunbar was last seen at home. His mode of dress at the time he went missing is unknown. All efforts to contact him have proven futile.\n\nAnyone knowing the whereabouts of Maurice Dunbar is being asked to contact the Central Village Police at 876-984-2644, police 119 emergency number or the nearest police station."
         },
         
         {
           "id": 61,
           "Name": "Zodian Kerr",
           "Gender": "Female",
           "Age": "29-years-old",
           "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/07/Zodian-Kerr-Web-495x400.jpg",
           "profile": "ZODIAN KERR\n\nTwenty-nine-year-old Zodian Kerr of Chester Castle, Hanover has been missing since Saturday, July 10.\n\nShe is of dark complexion, medium build and about 163 centimetres (5 feet 4 inches) tall.\n\nReports from the Ramble Police are that Kerr was last seen at home. Her mode of dress at the time she went missing is unknown. All efforts to contact her have proven futile.\n\nAnyone knowing the whereabouts of Zodian Kerr is being asked to contact the Ramble Police at 876-824-4197, police 119 emergency number or the nearest police station."
         },
               
         {
           "id": 62,
           "Name": "Kayana Kelly",
           "Gender": "Female",
           "Age": "14-years-old",
           "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/07/Kayana-Kelly-Web-495x400.jpg",
           "profile": "KAYANA KELLY\n\nAn Ananda Alert has been activated for 14-year-old Kayana Kelly, student of Eltham, Ocho Rios, St. Ann who has been missing since Saturday, June 26.\n\nShe is of brown complexion, slim build and about 152 centimetres (5 feet) tall.\n\nReports from the Ocho Rios Police are that she was last seen at home wearing a red sweat pants and a blue blouse.\n\nAnyone with information as to the whereabouts of Kayana Kelly is being asked to contact the Ocho Rios Police at (876) 974-2533, Police 119 emergency number or the nearest Police Station."
         },
               
         {
           "id": 63,
           "Name": "Romain Millin",
           "Gender": "Male",
           "Age": "20-years-old",
           "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/07/Romain-Millin-495x400.jpg",
           "profile": "ROMAIN MILLIN\n\nTwenty-year-old Romain Millin of Lime Hall district, St. Ann has been missing since Tuesday, July 06.\n\nHe is of brown complexion, slim build and about 183 centimetres (6 feet) tall.\n\nReports from the Bamboo Police are that about 12:30 p.m., Millin was last seen at home wearing a brown jeans shorts and a pair of blue shoes. Efforts to contact him have proven futile.\n\nAnyone knowing the whereabouts of Romain Millin is being asked to contact the Bamboo Police at (876), Police 119 emergency number or the nearest Police Station."
         },
 
         {
           "id": 64,
           "Name": "Julia Miller",
           "Gender": "Female",
           "Age": "19-years-old",
           "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/07/Julia-Miller-Web-495x400.jpg",
           "profile": "JULIA MILLER\n\nNineteen-year-old Julia Miller of Gibraltor district, Bog Walk in St. Catherine has been missing since Saturday, July 10.\n\nShe is of dark complexion, medium build and about 160 centimetres (5 feet 3 inches) tall.\n\nReports from the Bog Walk Police are that about 6:10 a.m., Miller was last seen leaving home wearing a white top, dark blue skirt and a pair of white crocs. Efforts to contact her have proven futile.\n\nAnyone knowing the whereabouts of Julia Miller is being asked to contact the Bog Walk Police at (876) 708-2081, Police 119 emergency number or the nearest police Station.\n\n "
         },
         {
           "id": 65,
           "Name": "Kerryann McKay",
           "Gender": "Female",
           "Age": "14-years-old",
           "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/07/Kerryann-McKay-495x400.jpg",
           "profile": "KERRYANN MCKAY\n\nAn Ananda Alert has been activated for 14-year-old Kerryann McKay student of Spring Piece, Ocho Rios in St. Ann who has been missing since March 2021.\n\nShe is of dark complexion and slim build.\n\nReports from the Ocho Rios Police are that Kerryann was last seen at home. Her mode of dress at the time she went missing is unknown. All efforts to contact her have failed.\n\n Anyone knowing the whereabouts of Kerryann McKay is asked to contact the Ocho Rios Police at 876-974-2533, Police 119 emergency number or the nearest police station."
         },
 
         {
           "id": 66,
           "Name": "Jaeleah Bethune",
           "Gender": "Female",
           "Age": "14-years-old",
           "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/07/Jaeleah-Bethune-Web-495x400.jpg",
           "profile": "JAELEAH BETHUNE\n\nAn Ananda Alert has been activated for 14-year-old Jaeleah Bethune of Paradise district, Hackers Hall, Bog Walk in St. Catherine who has been missing since Saturday, July 10.\n\nShe is of dark complexion, medium build and about 163 centimetres (5 feet 4 inches) tall.\n\nReports from the Constant Spring Police are that about 11:30 a.m., Jaeleah was last seen at home wearing a grey floral dress and a pair of black-and-white slippers. She has not been heard from since.\n\nAnyone knowing the whereabouts of Jaeleah Bethune is being asked to contact the Constant Spring police at 876-9241421, Police 119 emergency number or the nearest police station."
         },
 
         {
           "id": 67,
           "Name": "Javone Smith",
           "Gender": "Male",
           "Age": "21-years-old",
           "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/07/Javone-Smith-Web-495x400.jpg",
           "profile": "JAVONE SMITH\n\nTwenty-one-year-old Javone Smith of Sage Close, Portmore Pines in St. Catherine has been missing since Saturday, July 10.\n\n \n\nHe is of light complexion, slim built and about 177 centimetres (5 feet 10 inches) tall.\n\n \n\nReports are that Smith was last seen at home about 10:00 a.m. His mode of dress at the time he went missing is unknown. All efforts to contact him have proven futile.\n\n \n\nAnyone knowing the whereabouts of Javone Smith is asked to contact the Portmore Police at 876-989-8422, police 119 emergency or the nearest police station.\n\n "
         },
         {
           "id": 68,
           "Name": "Timothy Miller",
           "Gender": "Male",
           "Age": "16-years-old",
           "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/07/Timothy-Miller-Web-495x400.jpg",
           "profile": "TIMOTHY MILLER\n\nSixteen-year-old Timothy Miller otherwise called ‘Spuggy’, of Marcus Garvey Drive, Kingston 11 has been missing since Wednesday, July 07.\n\nHe is of dark complexion, slim build and about 183 centimetres (6 feet) tall.\n\nReports from the Hunts Bay Police are that Miller was last seen at home about 9:30 a.m., wearing a black T-shirt, black pants and a pair of white shoes. All efforts to contact him have proven.\n\nAnyone knowing the whereabouts of Miller is asked to contact the Hunts Bay Police at 876-923-7111, Police 119 emergency number or the nearest police station."
         },

           {
            "id":69,
            "Name": "Adiyah Dixon",
            "Gender": "Female",
            "Age": "14-years-old",
            "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/07/Adiyah-Dixon-Web-495x400.jpg",
            "profile": "ADIYAH DIXON\n\nAn Ananda Alert has been activated for 14-year-old Adiyah Dixon of St. Peters Square, Kingston 13 who has been missing since Saturday, July 10.\n\nShe is of dark complexion, slim build and about 168 centimetres (5 feet 6 inches) tall.\n\nReports from the Hunts Bay Police are that about 10:30 a.m., Adiyah was last seen leaving home dressed in a white striped shirt and black leggings. All efforts to contact her have proven futile.\n\nAnyone knowing the whereabouts of Adiyah Dixon is asked to contact the Hunts Bay Police at 876- 923-7111, Police 119 emergency numbers or the nearest police station."
           },
   
          {
            "id": 70,
            "Name": "Tashena Thomas",
            "Gender": "Female",
            "Age": "16-years-old",
            "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/07/Tashena-Thomas-Web-495x400.jpg",
            "profile": "TASHENA THOMAS\n\nAn Ananda Alert has been activated for 16-year-old Tashena Thomas of Lilliput district in St. James who has been missing since Wednesday, June 09.\n\nShe is of dark complexion, slim build about 175 centimetres (5 feet 9 inches) tall.\n\nReports from the Lilliput Police are that Tashena was last seen at home about 1:00 p.m., dressed in a brown blouse, blue jeans, and a pair of brown slippers. She has not been heard from since. All efforts to contact her have proven futile.\n\nAnyone knowing the whereabouts of Tashena Thomas is being asked to contact the Barrett Town police at 953-7899, Police 119 emergency number or the nearest police station."
          },
   
          {
             "id": 71,
             "Name": "Nickayla Campbell",
             "Gender": "Female",
             "Age": "16-years-old",
             "imageUrl": "https://jcf.gov.jm/wp-content/uploads/2021/07/Nickayla-Campbell-Web-495x400.jpg",
             "profile": "NICKAYLA CAMPBELL\n\nAn Ananda Alert has been activated for 16-year-old Nickayla Campbell of Exchange, Ocho Rios in St. Ann who has been missing since Sunday, July 11.\n\nShe is of dark complexion, medium build about 167 centimetres (5 feet 6 inches) tall.\n\nReports from the Ocho Rios Police are that about 11:00 a.m., Nickayla was last seen at home wearing a red dress. She has not been heard from since. All efforts to contact her have failed.\n\nAnyone knowing the whereabouts of Nickayla Campbell is being asked to contact the Ocho Rios police at 876-974-2533, Police 119 emergency number or the nearest police station."
          },
           
           {
             "id": 72,
             "Name": "Moesha Wright",
             "Gender": "Female",
             "Age": "15-years-old",
             "imageUrl": "https://icon-library.com/images/no-picture-available-icon/no-picture-available-icon-1.jpg",
             "profile": "No Detailas At This Time"   },
   
           {
             "id": 73,
             "Name": "Elizabeth Francis",
             "Gender": "Female",
             "Age": "16-years-old",
             "imageUrl": "https://icon-library.com/images/no-picture-available-icon/no-picture-available-icon-1.jpg",
             "profile": "No Detailas At This Time"   },
   
           {
             "id": 74,
             "Name": "Gabriel Castro",
             "Gender": "Male",
             "Age": "42-years-old",
             "imageUrl": "https://icon-library.com/images/no-picture-available-icon/no-picture-available-icon-1.jpg",
             "profile": "No Detailas At This Time"   },
                 
           {
             "id": 75,
             "Name": "Monique Farms",
             "Gender": "Female",
             "Age": "23-years-old",
             "imageUrl": "https://icon-library.com/images/no-picture-available-icon/no-picture-available-icon-1.jpg",
             "profile": "No Detailas At This Time"   },
   
           {
             "id": 76,
             "Name": "Kaylilah Miller",
             "Gender": "Female",
             "Age": "16-years-old",
             "imageUrl": "https://icon-library.com/images/no-picture-available-icon/no-picture-available-icon-1.jpg",
             "profile": "No Detailas At This Time"   },
           
           {
             "id": 77,
             "Name": "Isaiah Howell",
             "Gender": "Male",
             "Age": "77-years-old",
             "imageUrl": "https://icon-library.com/images/no-picture-available-icon/no-picture-available-icon-1.jpg",
             "profile": "No Detailas At This Time"    },
                 
           {
             "id": 78,
             "Name": "Ashanti Foote",
             "Gender": "Female",
             "Age": "18-years-old",
             "imageUrl": "https://icon-library.com/images/no-picture-available-icon/no-picture-available-icon-1.jpg",
             "profile": "No Detailas At This Time"   },
                 
           {
             "id": 79,
             "Name": "Tyrique Reid",
             "Gender": "Male",
             "Age": "24-years-old",
             "imageUrl": "https://icon-library.com/images/no-picture-available-icon/no-picture-available-icon-1.jpg",
             "profile": "No Detailas At This Time"    },
   
           {
             "id": 80,
             "Name": "Britannia Minzie",
             "Gender": "Female",
             "Age": "15-years-old",
             "imageUrl": "https://icon-library.com/images/no-picture-available-icon/no-picture-available-icon-1.jpg",
             "profile": "No Detailas At This Time"   },
           {
             "id": 81,
             "Name": "Garvey Lyndon",
             "Gender": "Male",
             "Age": "48-years-old",
             "imageUrl": "https://icon-library.com/images/no-picture-available-icon/no-picture-available-icon-1.jpg",
             "profile": "No Detailas At This Time"   },
   
           {
             "id": 82,
             "Name": "Tyera Grant",
             "Gender": "Female",
             "Age": "15-years-old",
             "imageUrl": "https://icon-library.com/images/no-picture-available-icon/no-picture-available-icon-1.jpg",
             "profile": "No Detailas At This Time"   },
   
           {
             "id": 83,
             "Name": "Alecisa White",
             "Gender": "Female",
             "Age": "15-years-old",
             "imageUrl": "https://icon-library.com/images/no-picture-available-icon/no-picture-available-icon-1.jpg",
             "profile": "No Detailas At This Time"   },
           {
             "id": 84,
             "Name": "Thonalee Blake",
             "Gender": "Female",
             "Age": "33-years-old",
             "imageUrl": "https://icon-library.com/images/no-picture-available-icon/no-picture-available-icon-1.jpg",
             "profile": "No Detailas At This Time"   }


  
  ]

}


